emacs/.emacs.d/config.org
#+PROPERTY: header-args    :results silent :noweb yes :tangle config.el
* use-package
   :PROPERTIES:
   :created:  2020-01-29 11:36:05 CST
   :END:
I use =use-package=. 

When I open emacs on a new machine, my packages should be automatically
downloaded. 
#+BEGIN_SRC emacs-lisp
  (require 'use-package-ensure)
  (setq use-package-always-ensure t)
#+END_SRC
* org
Related to =org-mode=. It's amazing how this has taken over my life. 
#+BEGIN_SRC emacs-lisp
(require 'org)
#+END_SRC

First, add the modules we use. 
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-modules 'org-habit)
#+END_SRC

Define the prefix key and bind it. 
#+BEGIN_SRC emacs-lisp
(fset 'jmw/org-prefix (make-sparse-keymap))
(global-set-key (kbd "C-c o") 'jmw/org-prefix)
#+END_SRC
** sched
My scheduling subsystem. Described in =~/core/mind/sys/meta=.

The core class is the run. 
#+begin_src emacs-lisp
(cl-defstruct jmw/run
  process-marker)
#+end_src

The run stack. 
#+begin_src emacs-lisp
(setq jmw/run-stack '())
#+end_src
*** agenda
   :PROPERTIES:
   :created:  2020-01-08 20:17:40 CST
   :END:
Related to the agenda, for instance:
- what displays
- how it displays
- how it is invoked

The main key sequence is
#+BEGIN_SRC emacs-lisp
  (global-set-key "\C-ca" 'org-agenda)
#+END_SRC

Specifying which days appear in the agenda:
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-span 10)
  (setq org-agenda-start-day "-4d")
#+END_SRC

Turn a heading into a habit. 
#+BEGIN_SRC emacs-lisp
  (defun jmw/org-make-habit ()
    "Turn the following heading into a habit. Schedules it for
  today with .+1d/2d repeater interval."
    (interactive)
    (let ((time (concat
		 "<"
		 (format-time-string "%F") ;; yyyy-mm-dd
		 " .+1d/2d")))
      (org-set-property "STYLE" "habit")
      (org-schedule '(1) time)))
  (define-key 'jmw/org-prefix "h" 'jmw/org-make-habit)
#+END_SRC

Set todo keywords.
#+BEGIN_SRC emacs-lisp
  (setq org-todo-keywords
	'((sequence "TODO(t)" "WAIT(w)" "|" "DONE(d)" "CANCEL(c)")))
#+END_SRC

Better colors for TODO keywords. 
#+BEGIN_SRC emacs-lisp
  (setq org-todo-keyword-faces
	'(("CANCEL" . (:foreground "red" :weight bold))
	  ("WAIT" . (:foreground "yellow" :weight bold))))
#+END_SRC

Don't change window configuration when viewing the agenda. According to
[[https://stackoverflow.com/q/21195327/4019495][SO]], there is no easy solution. The offender is =delete-other-windows= in
function =org-capture-place-template=. We adopt the solution given in
another [[https://stackoverflow.com/a/54251825/4019495][SO]] post.
#+BEGIN_SRC emacs-lisp
  (defun jmw/ad-org-agenda-place-template (oldfun args)
    (cl-letf (((symbol-function 'delete-other-windows) 'ignore))
      (apply oldfun args)))      
  (advice-add 'org-agenda
	      :around 'jmw/ad-org-capture-place-template)
  (setq org-agenda-window-setup 'other-window)
#+END_SRC

Other:
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-window-setup 'other-window)
  (setq org-agenda-restore-windows-after-quit t)
  (setq org-agenda-files '("~/core/mind/sys/short/proc/main.org"))
  (setq org-habit-show-habits-only-for-today nil)
#+END_SRC
*** org-clock
   :PROPERTIES:
   :created:  2020-01-08 20:31:18 CST
   :END:
The =org-clock= feature. This corresponds to the "live" part of sched. 

The interface is:
- ~C-c C-x C-i~, =jmw/org-clock-in=. Clock in on process at point and
  push onto the run stack.
- ~C-c C-x C-o~, =org-clock-out=. Clock out, not touching the stack. One
  of two ways to clock out without clocking into another function. The
  other is calling =jmw/org-clock-out-up= on a stack with one run.
- ~C-c C-x C-x~, =org-clock-in-last=. Clock into most recently clocked
  task, not touching the stack.
- ~C-c o o~, =jmw/org-clock-out-up=. Pop a run from the stack, and
  clock into the next. 
- ~C-c o d~, ~C-c o c~. =jmw/org-done=, =jmw/org-cancel=. Marks current
  task complete, then calls =jmw/org-clock-out-up=. 
- ~C-c o p~, =jmw/push-subtask=. Push a subtask onto the stack, and clock
  in.

I want =org-clock-history= to be long. 
#+BEGIN_SRC emacs-lisp
  (setq org-clock-history-length 35)
#+END_SRC

On the mode line, I want to see how much time I've spent today on the
task. The default is showing the amount of time spend since the
beginning of time, which is weird. 
#+BEGIN_SRC emacs-lisp
  (setq org-clock-mode-line-total 'today)
#+END_SRC

=org-clock-goto= should display some context above. 
#+BEGIN_SRC emacs-lisp
  (add-hook 'org-clock-goto-hook (lambda () (recenter-top-bottom 18)))
#+END_SRC

What follows are many commands related to task manipulation. I use
=org-clock-history= as a task stack.

=org-clock-goto= from anywhere, i.e jump to current clocking task in the
schedule.
#+BEGIN_SRC emacs-lisp
  (defun jmw/org-clock-goto ()
    (interactive)
    (select-frame-set-input-focus (jmw/main-sched-frame))
    (select-window (jmw/main-sched-window))
    (org-clock-goto))
  (define-key 'jmw/org-prefix "g" 'jmw/org-clock-goto)
#+END_SRC

Push a task onto the stack. Semantically, this is saying: the following
is relevant to completing the current task. Usually for tasks I discover
in the moment rather than ones I know at the outset.
#+BEGIN_SRC emacs-lisp
  (defun jmw/push-task (task-name)
    "Push a task onto the stack."
    (interactive "sTask name: ")
    (jmw/org-clock-goto)
    (org-insert-todo-heading-respect-content)
    (org-do-demote)
    (move-end-of-line 1)
    (insert task-name)
    (org-clock-in))
  (define-key 'jmw/org-prefix "p" 'jmw/push-task)
#+END_SRC
As of [2020-01-10 Fri], there is no symmetric notion for queueing a
task. Queueing a task can be done using ordinary insertion of a TODO
item. There is no notion of deferring a task (a la Go's =defer=) because
it can be done using ordinary TODO insertion.

Popping a task off the stack. Not called =jmw/pop-task= because calling
it doesn't mean the task is done.
#+BEGIN_SRC emacs-lisp
(defun jmw/org-clock-out-up ()
  "Clock out and go up a process in the stack."
  (interactive)
  (when (org-clocking-p)
    (let ((org-log-note-clock-out nil)
	        (org-clock-out-switch-to-state nil))
	    (org-clock-out)))
  (pop org-clock-history)
  (let* ((marker (pop org-clock-history))
	       (buf (marker-buffer marker)))
    (select-window (jmw/main-sched-window))
    (goto-char marker)
    (org-clock-in)))
(define-key 'jmw/org-prefix "o" 'jmw/org-clock-out-up)
#+END_SRC

Popping a task off the stack. This time, we're actually done the task.
#+BEGIN_SRC emacs-lisp
  (defun jmw/org-done ()
    (interactive)
    (jmw/org-clock-goto)
    (org-todo "DONE") 
		(jmw/org-clock-out-up))
  (define-key 'jmw/org-prefix "d" 'jmw/org-done)
#+END_SRC

Similarly, pop a task off the stack because we've decided not to do it.
#+BEGIN_SRC emacs-lisp
  (defun jmw/org-cancel ()
    (interactive)
    (jmw/org-clock-goto)
    (org-todo "CANCEL")
		(jmw/org-clock-out-up))
  (define-key 'jmw/org-prefix "c" 'jmw/org-cancel)
#+END_SRC

[2022-01-01 Sat 10:19] Goto daily list. 
#+begin_src emacs-lisp
(defun jmw/org-daily-goto ()
  (interactive)
  (select-frame-set-input-focus (jmw/main-sched-frame))
  (select-window (jmw/main-sched-window))
  (goto-char (org-find-exact-headline-in-buffer "daily")))
(define-key 'jmw/org-prefix "f" 'jmw/org-daily-goto)
#+end_src
*** other
   :PROPERTIES:
   :created:  2020-01-08 20:33:25 CST
   :END:
The window and frame containing =main.org=. 
#+BEGIN_SRC emacs-lisp
;; this uses an internal function, not ideal
(defun jmw/main-sched-frame ()
  jmw/main-frame)
(defun jmw/main-sched-window ()
  (get-buffer-window "main.org" (jmw/main-sched-frame)))
#+END_SRC
** org-babel
   :PROPERTIES:
   :created:  2020-01-08 20:39:50 CST
   :END:
Org's system for dealing with source code. 

Load it for go, because it isn't one of Org's default languages. 
#+BEGIN_SRC emacs-lisp 
(use-package ob-go)
#+END_SRC

[[https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-js.html][Org docs]] say to do this for js. 
#+BEGIN_SRC emacs-lisp
(require 'ob-js)
#+END_SRC

Load the org-babel languages I use. Necessary to get ~C-c C-c~ to
actually execute something.
#+BEGIN_SRC emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
	 (python . t)
	 (C . t)
	 (shell . t)
	 (go . t)
	 (js . t)
   (java . t)))
#+END_SRC

This is romantically named the "Library of Babel". As of
[2020-03-20 Fri], I've never used it.
#+BEGIN_SRC emacs-lisp
	(org-babel-lob-ingest "~/.emacs.d/library-of-babel.org")
#+END_SRC

Don't prompt for confirmation when executing code blocks. 
#+BEGIN_SRC emacs-lisp 
(setq org-confirm-babel-evaluate nil)
#+END_SRC

By default, editing org source reorganizes the frame. I want the new
buffer to appear in another window. 
#+BEGIN_SRC emacs-lisp
(setq org-src-window-setup 'other-window)
#+END_SRC

Better templates for creating source blocks.
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-structure-template-alist
	     '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist
	     '("py" . "src python"))
(add-to-list 'org-structure-template-alist
	     '("sh" . "src sh"))
#+END_SRC

Don't auto-indent src blocks.
#+BEGIN_SRC emacs-lisp
(setq org-src-preserve-indentation t)
#+END_SRC

New in Emacs 27: enable old structured template insertion. 
#+begin_src emacs-lisp
(require 'org-tempo)
#+end_src
** heading+list
   :PROPERTIES:
   :created:  2020-03-20 18:12:39 EDT
   :END:
Related to headings and lists. 

Expand lists like they are subheadings. 
#+BEGIN_SRC emacs-lisp
  (setq org-cycle-include-plain-lists 'integrate)
#+END_SRC

Don't insert random blank lines around entries. Don't split lines. 
#+BEGIN_SRC emacs-lisp
  (setq org-blank-before-new-entry 
	'((heading . nil)
	  (plain-list-item . nil))) 
  (setq org-M-RET-may-split-line
	'((headline . nil)
	  (item . nil)))
#+END_SRC

Insert creation time as a property when creating a headline. This is
useful for tasks---I may cancel something if it's been sitting around
for too long.
#+BEGIN_SRC emacs-lisp
  (defun jmw/org-insert-creation ()
    (org-set-property "created" (format-time-string "%F %T %Z")))
  (add-hook 'org-insert-heading-hook 'jmw/org-insert-creation)
#+END_SRC

I don't want to log every time an item is repeated. 
#+BEGIN_SRC emacs-lisp
  (setq org-log-repeat nil)
#+END_SRC

Allow refiling to any headline. 
#+BEGIN_SRC emacs-lisp
  (setq org-refile-targets '((nil . (:maxlevel . 10))))
#+END_SRC

Don't indent when demoting headlines.
#+BEGIN_SRC emacs-lisp
  (setq org-adapt-indentation nil)
#+END_SRC
