emacs/.emacs.d/config.el
  (require 'use-package-ensure)
  (setq use-package-always-ensure t)

(require 'org)

(add-to-list 'org-modules 'org-habit)

(fset 'jmw/org-prefix (make-sparse-keymap))
(global-set-key (kbd "C-c o") 'jmw/org-prefix)

(cl-defstruct jmw/run
  process-marker)

(setq jmw/run-stack '())

  (global-set-key "\C-ca" 'org-agenda)

  (setq org-agenda-span 10)
  (setq org-agenda-start-day "-4d")

  (defun jmw/org-make-habit ()
    "Turn the following heading into a habit. Schedules it for
  today with .+1d/2d repeater interval."
    (interactive)
    (let ((time (concat
		 "<"
		 (format-time-string "%F") ;; yyyy-mm-dd
		 " .+1d/2d")))
      (org-set-property "STYLE" "habit")
      (org-schedule '(1) time)))
  (define-key 'jmw/org-prefix "h" 'jmw/org-make-habit)

  (setq org-todo-keywords
	'((sequence "TODO(t)" "WAIT(w)" "|" "DONE(d)" "CANCEL(c)")))

  (setq org-todo-keyword-faces
	'(("CANCEL" . (:foreground "red" :weight bold))
	  ("WAIT" . (:foreground "yellow" :weight bold))))

  (defun jmw/ad-org-agenda-place-template (oldfun args)
    (cl-letf (((symbol-function 'delete-other-windows) 'ignore))
      (apply oldfun args)))      
  (advice-add 'org-agenda
	      :around 'jmw/ad-org-capture-place-template)
  (setq org-agenda-window-setup 'other-window)

  (setq org-agenda-window-setup 'other-window)
  (setq org-agenda-restore-windows-after-quit t)
  (setq org-agenda-files '("~/core/mind/sys/short/proc/main.org"))
  (setq org-habit-show-habits-only-for-today nil)

  (setq org-clock-history-length 35)

  (setq org-clock-mode-line-total 'today)

  (add-hook 'org-clock-goto-hook (lambda () (recenter-top-bottom 18)))

  (defun jmw/org-clock-goto ()
    (interactive)
    (select-frame-set-input-focus (jmw/main-sched-frame))
    (select-window (jmw/main-sched-window))
    (org-clock-goto))
  (define-key 'jmw/org-prefix "g" 'jmw/org-clock-goto)

  (defun jmw/push-task (task-name)
    "Push a task onto the stack."
    (interactive "sTask name: ")
    (jmw/org-clock-goto)
    (org-insert-todo-heading-respect-content)
    (org-do-demote)
    (move-end-of-line 1)
    (insert task-name)
    (org-clock-in))
  (define-key 'jmw/org-prefix "p" 'jmw/push-task)

(defun jmw/org-clock-out-up ()
  "Clock out and go up a process in the stack."
  (interactive)
  (when (org-clocking-p)
    (let ((org-log-note-clock-out nil)
	        (org-clock-out-switch-to-state nil))
	    (org-clock-out)))
  (pop org-clock-history)
  (let* ((marker (pop org-clock-history))
	       (buf (marker-buffer marker)))
    (select-window (jmw/main-sched-window))
    (goto-char marker)
    (org-clock-in)))
(define-key 'jmw/org-prefix "o" 'jmw/org-clock-out-up)

  (defun jmw/org-done ()
    (interactive)
    (jmw/org-clock-goto)
    (org-todo "DONE") 
		(jmw/org-clock-out-up))
  (define-key 'jmw/org-prefix "d" 'jmw/org-done)

  (defun jmw/org-cancel ()
    (interactive)
    (jmw/org-clock-goto)
    (org-todo "CANCEL")
		(jmw/org-clock-out-up))
  (define-key 'jmw/org-prefix "c" 'jmw/org-cancel)

;; this uses an internal function, not ideal
(defun jmw/main-sched-frame ()
  jmw/main-frame)
(defun jmw/main-sched-window ()
  (get-buffer-window "main.org" (jmw/main-sched-frame)))

(use-package ob-go)

(require 'ob-js)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
	 (python . t)
	 (C . t)
	 (shell . t)
	 (go . t)
	 (js . t)
   (java . t)))

	(org-babel-lob-ingest "~/.emacs.d/library-of-babel.org")

(setq org-confirm-babel-evaluate nil)

(setq org-src-window-setup 'other-window)

(add-to-list 'org-structure-template-alist
	     '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist
	     '("py" . "src python"))
(add-to-list 'org-structure-template-alist
	     '("sh" . "src sh"))

(setq org-src-preserve-indentation t)

(require 'org-tempo)

  (setq org-cycle-include-plain-lists 'integrate)

  (setq org-blank-before-new-entry 
	'((heading . nil)
	  (plain-list-item . nil))) 
  (setq org-M-RET-may-split-line
	'((headline . nil)
	  (item . nil)))

  (defun jmw/org-insert-creation ()
    (org-set-property "created" (format-time-string "%F %T %Z")))
  (add-hook 'org-insert-heading-hook 'jmw/org-insert-creation)

  (setq org-log-repeat nil)

  (setq org-refile-targets '((nil . (:maxlevel . 10))))

  (setq org-adapt-indentation nil)
