emacs/.emacs.d/config.org
** capture
   :PROPERTIES:
   :created:  2020-03-20 18:18:01 EDT
   :END:
=org-capture= is useful for someone with many miscellaneous thoughts. It
allows you to easily record something wherever you are. 

This is the recommended key binding. It has to be global. 
#+BEGIN_SRC emacs-lisp
  (global-set-key "\C-cc" 'org-capture)
#+END_SRC

=org-capture-templates= is the types of =org-capture='s you can perform.
#+BEGIN_SRC emacs-lisp
(setq org-capture-templates '())
#+END_SRC

Computer errors. I've had this happen many times: I get an error, I
can't figure it out after 2 or 3 hours, and forget about it. This is a
record of those experiences.
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-capture-templates
             '("e"
               "Computer error"
               entry
               (file "~/core/mind/ob/thm/cs/soft/err-log.org")
               "* %U %?\n %i"))
#+END_SRC

These are random thoughts to investigate further. 
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-capture-templates
             '("i"
               "interesting thought"
               entry
               (file+headline "~/core/mind/sys/short/proc/main.org"
                              "interesting thought")
               "* %U %?\n %i"))
#+END_SRC

These are things to google.
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-capture-templates
             '("g"
               "google search"
               entry
               (file+headline "~/core/mind/sys/short/proc/main.org"
                              "google search")
               "* %U %?\n %i"))
#+END_SRC

These are things related to =mind/other-mind=.
#+begin_src emacs-lisp
(add-to-list 'org-capture-templates
             '("m"
               "other-mind"
               entry
               (file+headline "~/core/mind/sys/short/proc/main.org"
                              "other mind")
               "* %U %?\n %i"))
#+end_src

Don't change window configuration during an =org-capture=. According to
[[https://stackoverflow.com/q/21195327/4019495][SO]], there is no easy solution. The offender is =delete-other-windows= in
function =org-capture-place-template=. We adopt the solution given in
another [[https://stackoverflow.com/a/54251825/4019495][SO]] post.
#+BEGIN_SRC emacs-lisp
  (defun jmw/ad-org-capture-place-template (oldfun args)
    (cl-letf (((symbol-function 'delete-other-windows) 'ignore))
      (apply oldfun args)))      
  (advice-add 'org-capture-place-template
	      :around 'jmw/ad-org-capture-place-template)
#+END_SRC
** markup
   :PROPERTIES:
   :created:  2020-03-20 18:28:51 EDT
   :END:
Textual markup. 

Allow for *this sentence to actually be formatted bold in org, even
though it spans multiple lines*. Following [[https://emacs.stackexchange.com/a/13828/21253][stackexchange]].
#+BEGIN_SRC emacs-lisp
  (setf (car (nthcdr 4 org-emphasis-regexp-components)) 50)
  (org-set-emph-re 'org-emphasis-regexp-components
		   org-emphasis-regexp-components)
#+END_SRC

Customizing the org emphasis characters (like the asterisk for turning
text bold). According to [[https://www.mail-archive.com/emacs-orgmode@gnu.org/msg115307.html][this]] message, adding different characters is
not going to happen.
#+BEGIN_SRC emacs-lisp
  (setq org-emphasis-alist
	'(("*" (bold :foreground "Yellow")) ;; like highlighting
	  ("/" italic)
	  ("_" underline)
	  ("=" org-verbatim verbatim)
	  ("~" org-code verbatim)
	  ("+" (:strike-through t))))
#+END_SRC

Adds a comment. Mainly for annotating books (see
=russell-happy.org=). The implementation may change with aesthetic
preferences. The "a" prefix is for "annotation".
#+BEGIN_SRC emacs-lisp
  (defun jmw/org-comment ()
    (interactive)
    (insert "*")
    (org-time-stamp-inactive '(16))
    (insert " JMW:* "))
  (define-key 'jmw/org-prefix "ac" 'jmw/org-comment)
#+END_SRC

Highlight an active region. 
#+BEGIN_SRC emacs-lisp
  (defun jmw/org-highlight-region (from to)
    (interactive "r")
    (when (use-region-p)
      (save-excursion
	(goto-char to)
	(insert "*")
	(goto-char from)
	(insert "*"))
      (deactivate-mark)
      (fill-paragraph)))
  (define-key 'jmw/org-prefix "ah" 'jmw/org-highlight-region)
#+END_SRC

This stores the current location of point for pasting into an org
file. This is critical for org's hypertext capabilities.
#+BEGIN_SRC emacs-lisp
  (global-set-key "\C-cl" 'org-store-link) 
#+END_SRC
** other
When displayed, I like lines to wrap around rather than disappear off
the edge. It makes tables look terrible, but whatever.
#+BEGIN_SRC emacs-lisp
  (setq org-startup-truncated nil)
#+END_SRC

Special characters. This'll display them in the buffer and correctly
export to HTML. As of [2020-03-20 Fri], most of these were created to
take notes for 18.675. 
#+BEGIN_SRC emacs-lisp
  (setq org-entities-user ; special symbols
	'(("scrB" "\\scrB" t "&#x212C;" "B" "B" "â„¬") ; "script B"
	  ("scrS" "\\scrS" t "&#x1D4AE;" "S" "S" "ð’®") 
	  ("scrF" "\\scrF" t "&#x2131;" "F" "F" "â„±") 
	  ("RR" "\\RR" t "&#x211D;" "R" "R" "â„") 
	  ("ZZ" "\\ZZ" t "&#x2124;" "Z" "Z" "â„¤") 
	  ("CC" "\\CC" t "&#x2102;" "C" "C" "â„‚") 
	  ("PP" "\\PP" t "&#x2119;" "P" "P" "â„™") ; prob
	  ("EE" "\\EE" t "&#x1D53C;" "E" "E" "ð”¼") ; e.v.
	  ("eps" "\\eps" t "&#x03B5;" "e" "e" "Îµ") 
	  ("iff" "\\iff" t "&#x21D4;" "<->" "<->" "â‡”") 
	  ("imp" "\\imp" t "&#x21D2;" "->" "->" "â‡’") 
	  ("del" "\\del" t "&#x2202;" "d" "d" "âˆ‚") 
	  ("NN" "\\NN" t "&#x2115;" "N" "N" "â„•") 
	  ("QQ" "\\QQ" t "&#x211A;" "Q" "Q" "â„š") 
	  ))
#+END_SRC
* pkg
Related to an emacs package. 
** auctex
For editing source files in the TeX family. 
#+BEGIN_SRC emacs-lisp 
(use-package tex
  :config
  <<auctex-config>>

  :defer t
  :ensure auctex)
#+END_SRC
*** cfg
:PROPERTIES:
:created:  2020-03-27 18:30:46 EDT
:header-args+: :noweb-ref auctex-config :tangle no
:END:
What program to view TeX output. Change pdf to use =xdg-open=. Using
=setf= feels like cheating. 
#+BEGIN_SRC emacs-lisp
(setf (alist-get 'output-pdf TeX-view-program-selection) '("xdg-open"))
#+END_SRC

These are recommended in section 5.3 of the AUCTeX manual, "Automatic
Parsing of TeX Files". They have something to do with the =auto=
directory and parsing speed. 
#+BEGIN_SRC emacs-lisp
(setq TeX-auto-save t)
(setq TeX-parse-self t)
#+END_SRC

Query for the master file every time. 
#+BEGIN_SRC emacs-lisp
(setq-default TeX-master nil)
#+END_SRC

Don't raise/lower sub/superscripts. It looks weird. 
#+BEGIN_SRC emacs-lisp
(setq font-latex-fontify-script nil)
#+END_SRC

Add completion for =\autoref=. [2022-03-01 Tue 00:06] There's probably
an easier way to do this. [2022-05-13 Fri 23:04] edited. Yes, there
was. See
https://emacs.stackexchange.com/questions/22205/declaring-custom-completions-to-auctex.
#+begin_src emacs-lisp
(add-hook 'LaTeX-mode-hook
          (lambda ()
            (TeX-add-symbols '("autoref" TeX-arg-ref))))
#+end_src
** elpy
For editing Python source files. 

Copied and pasted. 
#+BEGIN_SRC emacs-lisp 
(use-package elpy
	:defer t
	:init
	(advice-add 'python-mode :before 'elpy-enable)

	:bind (:map elpy-mode-map
							<<elpy-mode-map>>)

	:config
	;; Needed to get xref-find-definitions working
	;; See https://github.com/jorgenschaefer/elpy/issues/948
	(setq elpy-rpc-backend "jedi")
	)
#+END_SRC

To behave like ~C-M-f~, ~C-M-d~, etc.
#+BEGIN_SRC emacs-lisp :noweb-ref elpy-mode-map :tangle no
("C-c C-f" . elpy-nav-forward-block)
("C-c C-b" . elpy-nav-backward-block)
#+END_SRC
** buffer-move
Switches buffers between windows. This is super useful. 
#+BEGIN_SRC emacs-lisp
  (use-package buffer-move
    :bind
    (("<C-S-up>" . 'buf-move-up)
     ("<C-S-down>" . 'buf-move-down)
     ("<C-S-left>" . 'buf-move-left)
     ("<C-S-right>" . 'buf-move-right)))
#+END_SRC
** emms
EMMS is the Emacs MultiMedia System. I use it for playing music. 
#+BEGIN_SRC emacs-lisp
  (use-package emms-setup
    :config
    (emms-all)
    (emms-default-players)
    (setq emms-source-file-default-directory "~/core/mind/env/ext")
    (setq emms-repeat-playlist t)
    (emms-mode-line 0)
    (emms-playing-time 0)
    (emms-add-directory-tree (concat
			      emms-source-file-default-directory
			      "/chills"))
    (emms-shuffle)

    :ensure emms)
#+END_SRC

Define my emms prefix. 
#+BEGIN_SRC emacs-lisp
  (fset 'jmw/emms-prefix (make-sparse-keymap))
  (global-set-key (kbd "C-c e") 'jmw/emms-prefix)
#+END_SRC

Pause the music. 
#+BEGIN_SRC emacs-lisp
  (define-key 'jmw/emms-prefix (kbd "<SPC>") 'emms-pause)
#+END_SRC
** cc-mode
For editing C source files. 

Use "line comment style", i.e =//= style comments. 
#+BEGIN_SRC emacs-lisp
(add-hook 'c-mode-hook (lambda () (c-toggle-comment-style -1)))
#+END_SRC
** hexl
Emacs's built-in hex editor. 
#+BEGIN_SRC emacs-lisp
(global-set-key "\C-x\C-h" 'hexl-find-file)
#+END_SRC
** pyim
A Chinese input method. Installed because ibus pinyin wasn't working
with fullscreen emacs.

[2020-10-06 Tue 11:45] Don't use it. 
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package pyim
    :config
    (require 'pyim-basedict)
    (pyim-basedict-enable)
    (setq default-input-method "pyim"))
#+END_SRC
** lorem ipsum
   :PROPERTIES:
   :created:  2020-01-29 12:20:45 CST
   :END:
Add lorem ipsum filler text to emacs. The utility of this is avoiding
writing that random one-off script (or find a suitable document) when
you need to generate text.
#+BEGIN_SRC emacs-lisp
  (use-package lorem-ipsum)
#+END_SRC

I don't use the default bindings because it conflicts with org-mode's
~C-c l~.
** vterm
   :PROPERTIES:
   :created:  2020-01-29 19:03:53 CST
   :END:
A terminal emulator that
- allows curses based applications
- ignores certain shortcuts like ~C-x C-f~ (passes them to emacs)
#+BEGIN_SRC emacs-lisp
  (use-package vterm
    :config
    (setq vterm-min-window-width 50))
#+END_SRC

Define my vterm prefix
#+BEGIN_SRC emacs-lisp
  (fset 'jmw/vterm-prefix (make-sparse-keymap))
  (global-set-key (kbd "C-c v") 'jmw/vterm-prefix)
#+END_SRC

Bind functions
#+BEGIN_SRC emacs-lisp
  (define-key 'jmw/vterm-prefix "b" 'vterm)
  (define-key 'jmw/vterm-prefix "o" 'vterm-other-window)
#+END_SRC

Recommended on [[https://github.com/akermu/emacs-libvterm][github]]. Easier way to do directory tracking. 
#+begin_src emacs-lisp
(add-to-list 'vterm-eval-cmds '("update-pwd" (lambda (path) (setq default-directory path))))
#+end_src

Don't prompt for killing vterm buffers. Code from [[https://stackoverflow.com/a/2708042/4019495][SO]]. 
#+BEGIN_SRC emacs-lisp
  (add-hook 'vterm-mode-hook
	    (lambda ()
	      (set-process-query-on-exit-flag
	       (get-buffer-process (current-buffer)) nil)))	  
#+END_SRC
** go-mode
   :PROPERTIES:
   :created:  2020-02-05 08:31:27 EST
   :END:
Major mode for Go source files. 
#+BEGIN_SRC emacs-lisp
  (use-package go-mode
	  :bind
	  (:map go-mode-map
	  ("M-." . godef-jump)
	  ("C-x 4 ." . godef-jump-other-window)
	  ("C-c C-d" . godoc-at-point))

	  :config
	  ;; (setq godoc-at-point-function 'godoc-gogetdoc)
	  )
#+END_SRC

