emacs/.emacs.d/config.el

  (global-set-key "\C-cc" 'org-capture)

(setq org-capture-templates '())

(add-to-list 'org-capture-templates
             '("e"
               "Computer error"
               entry
               (file "~/core/mind/ob/thm/cs/soft/err-log.org")
               "* %U %?\n %i"))

(add-to-list 'org-capture-templates
             '("i"
               "interesting thought"
               entry
               (file+headline "~/core/mind/sys/short/proc/main.org"
                              "interesting thought")
               "* %U %?\n %i"))

(add-to-list 'org-capture-templates
             '("g"
               "google search"
               entry
               (file+headline "~/core/mind/sys/short/proc/main.org"
                              "google search")
               "* %U %?\n %i"))

  (defun jmw/ad-org-capture-place-template (oldfun args)
    (cl-letf (((symbol-function 'delete-other-windows) 'ignore))
      (apply oldfun args)))      
  (advice-add 'org-capture-place-template
	      :around 'jmw/ad-org-capture-place-template)

  (setf (car (nthcdr 4 org-emphasis-regexp-components)) 50)
  (org-set-emph-re 'org-emphasis-regexp-components
		   org-emphasis-regexp-components)

  (setq org-emphasis-alist
	'(("*" (bold :foreground "Yellow")) ;; like highlighting
	  ("/" italic)
	  ("_" underline)
	  ("=" org-verbatim verbatim)
	  ("~" org-code verbatim)
	  ("+" (:strike-through t))))

  (defun jmw/org-comment ()
    (interactive)
    (insert "*")
    (org-time-stamp-inactive '(16))
    (insert " JMW:* "))
  (define-key 'jmw/org-prefix "ac" 'jmw/org-comment)

  (defun jmw/org-highlight-region (from to)
    (interactive "r")
    (when (use-region-p)
      (save-excursion
	(goto-char to)
	(insert "*")
	(goto-char from)
	(insert "*"))
      (deactivate-mark)
      (fill-paragraph)))
  (define-key 'jmw/org-prefix "ah" 'jmw/org-highlight-region)

  (global-set-key "\C-cl" 'org-store-link)

  (setq org-startup-truncated nil)

  (setq org-entities-user ; special symbols
	'(("scrB" "\\scrB" t "&#x212C;" "B" "B" "â„¬") ; "script B"
	  ("scrS" "\\scrS" t "&#x1D4AE;" "S" "S" "ð’®") 
	  ("scrF" "\\scrF" t "&#x2131;" "F" "F" "â„±") 
	  ("RR" "\\RR" t "&#x211D;" "R" "R" "â„") 
	  ("ZZ" "\\ZZ" t "&#x2124;" "Z" "Z" "â„¤") 
	  ("CC" "\\CC" t "&#x2102;" "C" "C" "â„‚") 
	  ("PP" "\\PP" t "&#x2119;" "P" "P" "â„™") ; prob
	  ("EE" "\\EE" t "&#x1D53C;" "E" "E" "ð”¼") ; e.v.
	  ("eps" "\\eps" t "&#x03B5;" "e" "e" "Îµ") 
	  ("iff" "\\iff" t "&#x21D4;" "<->" "<->" "â‡”") 
	  ("imp" "\\imp" t "&#x21D2;" "->" "->" "â‡’") 
	  ("del" "\\del" t "&#x2202;" "d" "d" "âˆ‚") 
	  ("NN" "\\NN" t "&#x2115;" "N" "N" "â„•") 
	  ("QQ" "\\QQ" t "&#x211A;" "Q" "Q" "â„š") 
	  ))

(use-package tex
  :config
  (setf (alist-get 'output-pdf TeX-view-program-selection) '("xdg-open"))
  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq-default TeX-master nil)
  (setq font-latex-fontify-script nil)

  :defer t
  :ensure auctex)

(use-package elpy
	:defer t
	:init
	(advice-add 'python-mode :before 'elpy-enable)

	:bind (:map elpy-mode-map
							("C-c C-f" . elpy-nav-forward-block)
							("C-c C-b" . elpy-nav-backward-block))

	:config
	;; Needed to get xref-find-definitions working
	;; See https://github.com/jorgenschaefer/elpy/issues/948
	(setq elpy-rpc-backend "jedi")
	)

  (use-package buffer-move
    :bind
    (("<C-S-up>" . 'buf-move-up)
     ("<C-S-down>" . 'buf-move-down)
     ("<C-S-left>" . 'buf-move-left)
     ("<C-S-right>" . 'buf-move-right)))

  (use-package emms-setup
    :config
    (emms-all)
    (emms-default-players)
    (setq emms-source-file-default-directory "~/core/mind/env/ext")
    (setq emms-repeat-playlist t)
    (emms-mode-line 0)
    (emms-playing-time 0)
    (emms-add-directory-tree (concat
			      emms-source-file-default-directory
			      "/chills"))
    (emms-shuffle)

    :ensure emms)

  (fset 'jmw/emms-prefix (make-sparse-keymap))
  (global-set-key (kbd "C-c e") 'jmw/emms-prefix)

  (define-key 'jmw/emms-prefix (kbd "<SPC>") 'emms-pause)

(add-hook 'c-mode-hook (lambda () (c-toggle-comment-style -1)))

(global-set-key "\C-x\C-h" 'hexl-find-file)

  (use-package lorem-ipsum)

  (use-package vterm
    :config
    (setq vterm-min-window-width 50))

  (fset 'jmw/vterm-prefix (make-sparse-keymap))
  (global-set-key (kbd "C-c v") 'jmw/vterm-prefix)

  (define-key 'jmw/vterm-prefix "b" 'vterm)
  (define-key 'jmw/vterm-prefix "o" 'vterm-other-window)

(add-to-list 'vterm-eval-cmds '("update-pwd" (lambda (path) (setq default-directory path))))

  (add-hook 'vterm-mode-hook
	    (lambda ()
	      (set-process-query-on-exit-flag
	       (get-buffer-process (current-buffer)) nil)))

  (use-package go-mode
	  :bind
	  (:map go-mode-map
	  ("M-." . godef-jump)
	  ("C-x 4 ." . godef-jump-other-window)
	  ("C-c C-d" . godoc-at-point))

	  :config
	  ;; (setq godoc-at-point-function 'godoc-gogetdoc)
	  )

  (use-package ivy)
  (ivy-mode 1)
