emacs/.emacs.d/config.org
** ivy
   :PROPERTIES:
   :created:  2020-02-16 16:41:13 EST
   :END:
A better way to select an item from a list. This includes
- ~C-x C-f~
- ~M-x~
#+BEGIN_SRC emacs-lisp
  (use-package ivy)
  (ivy-mode 1)
#+END_SRC

These are the recommended customizations.
#+BEGIN_SRC emacs-lisp
  (setq ivy-use-virtual-buffers t)
  (setq ivy-count-format "(%d/%d) ")
#+END_SRC 

Ignore order of input tokens. This is the default of helm. 
#+BEGIN_SRC emacs-lisp
    (setq ivy-re-builders-alist
	  '((t . ivy--regex-ignore-order)))
#+END_SRC
*** counsel
   :PROPERTIES:
   :created:  2020-02-16 21:51:03 EST
   :END:
#+BEGIN_SRC emacs-lisp
  (use-package counsel
    :bind (:map global-map
		("M-x" . counsel-M-x)
		("C-x C-f" . counsel-find-file)
		("M-y" . counsel-yank-pop)
		("C-h v" . counsel-describe-variable)
		("C-h f" . counsel-describe-function)
	   :map org-mode-map
	   ("C-c C-j" . counsel-org-goto))

    :config
    (setq ivy-initial-inputs-alist '(()))
    (setq counsel-find-file-at-point t))
#+END_SRC

Push onto the org mark ring when using counsel to goto. We want the mark
ring to be large.
#+BEGIN_SRC emacs-lisp
  (defun jmw/ad-counsel-org-goto ()
    (org-mark-ring-push))
  (advice-add 'counsel-org-goto
	      :before 'jmw/ad-counsel-org-goto)
  (setq org-mark-ring-length 16)
#+END_SRC
*** ivy-rich
   :PROPERTIES:
   :created:  2020-02-18 15:31:59 EST
   :END:
Display more info in ivy. For example, make ~M-x~ display a column of
documentation alongside the list of candidate functions. 
#+BEGIN_SRC emacs-lisp
  (use-package ivy-rich
    :config
    ;; (ivy-rich-mode 1)
    )
#+END_SRC

The reason I looked into this was for =counsel-find-file=. I wanted to
see =ls -l= like stuff. 

The first step is to define a function for the file size. 
#+BEGIN_SRC emacs-lisp
  (defun ivy-rich-file-size (candidate)
    (let ((fname (expand-file-name candidate ivy--directory)))
      (if (or (not (file-exists-p fname)) (file-remote-p fname))
	  ""
	(file-size-human-readable (file-attribute-size
				   (file-attributes fname))
				  "si"))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (plist-put ivy-rich-display-transformers-list
	     'counsel-find-file
	     '(:columns
	      ((ivy-rich-candidate
		(:width 40))
	       ;; (ivy-rich-file-user
	       ;;  (:width 4 :face font-lock-doc-face))
	       ;; (ivy-rich-file-group
	       ;;  (:width 4 :face font-lock-doc-face))
	       ;; (ivy-rich-file-modes
		;; (:width 11 :face font-lock-doc-face))
	       (ivy-rich-file-size
		(:width 6 :face font-lock-doc-face))
	       (ivy-rich-counsel-find-file-truename
		(:face font-lock-doc-face))
	       ;; (ivy-rich-file-last-modified-time
	       ;;  (:width 30 :face font-lock-doc-face))
	       )))
  (ivy-rich-set-display-transformer)
#+END_SRC

When =t=, this prompted me for my scp password whenever I had a ssh
connection to =aloysius=. 
#+BEGIN_SRC emacs-lisp
(setq ivy-rich-parse-remote-buffer nil)
#+END_SRC
** exwm
   :PROPERTIES:
   :created:  2020-03-01 19:11:44 EST
   :END:
The Emacs OS. For contessa, added desktop entry for emacs. 

Whether to use EXWM and load its config. Currently very simple: use
=wmctrl(1)= to test if a WM is already running.
#+begin_src emacs-lisp 
(setq jmw/use-exwmp
      (not (eq (call-process-shell-command "wmctrl -m")
               0)))
#+end_src

The following doesn't work. When using EXWM, then these lines are run
the DE hasn't been set up yet, causing =wmctrl= to give an error. 
#+begin_src emacs-lisp :tangle no
(setq jmw/current-wm
      (shell-command-to-string
       "wmctrl -m | grep 'Name' | cut -d':' -f2 | xargs echo -n"))
(setq jmw/use-exwmp
      (string= jmw/current-wm "EXWM"))
#+end_src

Load.
#+BEGIN_SRC emacs-lisp 
(when jmw/use-exwmp
  (use-package exwm
    :ensure nil 
    :demand t

    :config
    <<exwm-config>>))
#+END_SRC
*** cfg
:PROPERTIES:
:created:  2020-03-24 15:33:23 EDT
:header-args+: :noweb-ref exwm-config :tangle no
:END:
This heading is tangled into =exwm='s =use-package= form with Org's
noweb.

Setup the X system tray. 
#+BEGIN_SRC emacs-lisp
  (require 'exwm-systemtray)
  (exwm-systemtray-enable)
  (setq exwm-systemtray-height 16)
#+END_SRC

We want 8 workspaces by default. 
#+BEGIN_SRC emacs-lisp
  (setq exwm-workspace-number 8)
#+END_SRC

These are the "most global" key bindings. They work in line mode and
char mode.
#+BEGIN_SRC emacs-lisp
(setq exwm-input-global-keys
      `(
        ([?\s-r] . exwm-reset)
        ([?\s-w] . exwm-workspace-switch)
        ,@(mapcar (lambda (i)
                    `(,(kbd (format "s-%d" i)) .
                      (lambda ()
                        (interactive)
                        (exwm-workspace-switch-create ,i))))
                  (number-sequence 0 9))
        ([?\s-&] . (lambda (command)
                     (interactive (list (read-shell-command "$ ")))
                     (start-process-shell-command command nil command)))
        (,(kbd "C-;") . other-window)
        (,(kbd "C-'") . other-frame)
        (,(kbd "s-k") . exwm-workspace-delete)
        (,(kbd "s-l") . jmw/lock-screen)
        ))
#+END_SRC

Key translations in line mode. For instance, ~C-c~ is normally captured
by emacs and never sent to the application. To copy text, then, we make
~M-w~ translate to ~C-c~. 
#+BEGIN_SRC emacs-lisp
  (setq exwm-input-simulation-keys
	'(
	  ([?\M-w] . [?\C-c])
	  ([?\C-y] . [?\C-v])
	  ))
#+END_SRC

Allow us to see and switch to buffers in other workspaces. 
#+BEGIN_SRC emacs-lisp
  (setq exwm-workspace-show-all-buffers t)
  (setq exwm-layout-show-all-buffers t)
#+END_SRC

This hook is run when =WM_CLASS= (part of X) changes. We use this to
name EXWM buffers. By default, they're all called =*EXWM*=. This makes
the buffer with firefox called =firefox=, the buffer with anki called
=Anki=, etc.
#+BEGIN_SRC emacs-lisp
  (add-hook 'exwm-update-class-hook
	    (lambda ()
	      (exwm-workspace-rename-buffer exwm-class-name)))
#+END_SRC

=exwm-input-prefix-keys= are prefix keys sent to Emacs in line mode. For
instance, ~C-x~ is sent to Emacs (and thus never the application) so
that ~C-x b~ works from anywhere. 

I don't usually need help on Emacs (~C-c h~) from an EXWM buffer. ~C-h~
also conflicts with some other stuff, ex.
- Anki add card history
- Firefox history
#+BEGIN_SRC emacs-lisp
  (setq exwm-input-prefix-keys (delete ?\C-h exwm-input-prefix-keys))
#+END_SRC

Be able to quit from anywhere. Not sure why ~C-g~ isn't in
=exwm-input-prefix-keys= by default. 
#+BEGIN_SRC emacs-lisp
  (setq exwm-input-prefix-keys (add-to-list 'exwm-input-prefix-keys ?\C-g))
#+END_SRC

The [[https://github.com/ch11ng/exwm/wiki/Configuration-Example][example config]] given in the wiki says you need to add this, but it
can be anywhere in your config.
#+BEGIN_SRC emacs-lisp
  (exwm-enable)
#+END_SRC

[2021-06-28 Mon 20:56] My pinyin IME, [[https://wiki.archlinux.org/title/IBus][IBus]]. This is Arch's recommended
command for starting the daemon. Options (~man ibus-daemon~):
- d: daemonize
- r: replace
- x: execute ibus XIM server (??)
- R: not in manual
#+begin_src emacs-lisp
(call-process-shell-command "ibus-daemon -drxR")
#+end_src
**** desktop-environment
     :PROPERTIES:
     :created:  2020-03-10 00:22:02 EDT
     :END:
We want to use this only if we're using EXWM. 
#+BEGIN_SRC emacs-lisp
  (use-package desktop-environment
    :ensure nil

    :config
    ;; For some reason, this has to be after exwm setup
    (setq desktop-environment-update-exwm-global-keys :global)
    (desktop-environment-mode))
#+END_SRC

Redefine to take a screenshot of a region and copy to clipboard. By
default, =desktop-environment-screenshot= saves the entire screen to
some specified directory. This took me way too long to hack. Some
oddities:
- The ~sleep 0.1~ at the beginning is suggested by [[https://bbs.archlinux.org/viewtopic.php?id=86507][this old archlinux
  bbs]] thread. If it's not there, on EXWM windows it gives the error
  "Couldn't grab keyboard".
- The plethora of flags is to get =scrot(1)= to copy to clipboard. 
- The ~&>/dev/null~ needs to be there, else =scrot(1)= hangs. Why? Who
  knows.
This is the state as of [2020-03-21 Sat]. Let's hope this will one day
be written better. 
#+BEGIN_SRC emacs-lisp
  (defun desktop-environment-screenshot ()
    (interactive)
    (shell-command "sleep 0.2; scrot -s '/tmp/%F_%T_$wx$h.png' -e 'xclip -selection clipboard -target image/png -i $f &>/dev/null'"))
#+END_SRC
**** display-time-mode
     :PROPERTIES:
     :created:  2020-03-17 16:01:31 EDT
     :END:
  Display the current time on the modeline. Used in conjunction with
  mini-modeline for my system tray. 

  Formatting. 
  #+BEGIN_SRC emacs-lisp
    (setq display-time-day-and-date t)
    (setq display-time-24hr-format t)
  #+END_SRC

  Do not display the load average. No idea why this is displayed alongside
  time by default. 
  #+BEGIN_SRC emacs-lisp
    (setq display-time-default-load-average nil)
  #+END_SRC

  Use it.
  #+BEGIN_SRC emacs-lisp
    (display-time-mode 1)
  #+END_SRC
**** display-battery-mode
     :PROPERTIES:
     :created:  2020-03-17 16:18:23 EDT
     :END:
  Display battery status on the modeline. Used in conjuction with
  mini-modeline for my system tray.
  #+BEGIN_SRC emacs-lisp
    (display-battery-mode 1)
  #+END_SRC
** smart-mode-line
   :PROPERTIES:
   :created:  2020-03-16 17:17:54 EDT
   :END:
A more customizable mode line. 

Mark all themes as safe. 
#+BEGIN_SRC emacs-lisp
  (setq custom-safe-themes t)
#+END_SRC

Main loading. 
#+BEGIN_SRC emacs-lisp 
(use-package smart-mode-line
  :config
  <<smart-mode-line-config>>
  )
#+END_SRC
*** cfg
:PROPERTIES:
:created:  2020-06-02 22:05:42 EDT
:header-args: :tangle no :noweb-ref smart-mode-line-config :results silent
:END:
Sml is supposed to automatically detect theme. It doesn't. 
#+BEGIN_SRC emacs-lisp
(setq sml/theme 'dark)
#+END_SRC

Makes modes more compact. Before, Narrow mode would be all the way at
the right. 
#+BEGIN_SRC emacs-lisp
(setq sml/mode-width 0)
#+END_SRC

Main invocation.
#+BEGIN_SRC emacs-lisp
(sml/setup)
#+END_SRC
** mini-modeline
   :PROPERTIES:
   :created:  2020-03-17 14:38:32 EDT
   :END:
Move modeline to reside in minibuffer area. Now, only the current
window's mode line is displayed. 

The issue with the default is a lot of info is repeated---the current
time, the current clocking task, etc. Furthermore, with the way I
horizontally split windows, the info wouldn't even fit. 

This is much cleaner. 
#+BEGIN_SRC emacs-lisp
(use-package mini-modeline
  :after smart-mode-line

  :config
  <<mini-modeline-config>>
  )
#+END_SRC
