emacs/.emacs.d/config.el

  (setq ivy-use-virtual-buffers t)
  (setq ivy-count-format "(%d/%d) ")

    (setq ivy-re-builders-alist
	  '((t . ivy--regex-ignore-order)))

  (use-package counsel
    :bind (:map global-map
		("M-x" . counsel-M-x)
		("C-x C-f" . counsel-find-file)
		("M-y" . counsel-yank-pop)
		("C-h v" . counsel-describe-variable)
		("C-h f" . counsel-describe-function)
	   :map org-mode-map
	   ("C-c C-j" . counsel-org-goto))

    :config
    (setq ivy-initial-inputs-alist '(()))
    (setq counsel-find-file-at-point t))

  (defun jmw/ad-counsel-org-goto ()
    (org-mark-ring-push))
  (advice-add 'counsel-org-goto
	      :before 'jmw/ad-counsel-org-goto)
  (setq org-mark-ring-length 16)

  (use-package ivy-rich
    :config
    ;; (ivy-rich-mode 1)
    )

  (defun ivy-rich-file-size (candidate)
    (let ((fname (expand-file-name candidate ivy--directory)))
      (if (or (not (file-exists-p fname)) (file-remote-p fname))
	  ""
	(file-size-human-readable (file-attribute-size
				   (file-attributes fname))
				  "si"))))

  (plist-put ivy-rich-display-transformers-list
	     'counsel-find-file
	     '(:columns
	      ((ivy-rich-candidate
		(:width 40))
	       ;; (ivy-rich-file-user
	       ;;  (:width 4 :face font-lock-doc-face))
	       ;; (ivy-rich-file-group
	       ;;  (:width 4 :face font-lock-doc-face))
	       ;; (ivy-rich-file-modes
		;; (:width 11 :face font-lock-doc-face))
	       (ivy-rich-file-size
		(:width 6 :face font-lock-doc-face))
	       (ivy-rich-counsel-find-file-truename
		(:face font-lock-doc-face))
	       ;; (ivy-rich-file-last-modified-time
	       ;;  (:width 30 :face font-lock-doc-face))
	       )))
  (ivy-rich-set-display-transformer)

(setq ivy-rich-parse-remote-buffer nil)

(use-package exwm
  :ensure nil 
  :demand t

  :config
    (require 'exwm-systemtray)
    (exwm-systemtray-enable)
    (setq exwm-systemtray-height 16)
    (setq exwm-workspace-number 8)
  (setq exwm-input-global-keys
        `(
          ([?\s-r] . exwm-reset)
          ([?\s-w] . exwm-workspace-switch)
          ,@(mapcar (lambda (i)
                      `(,(kbd (format "s-%d" i)) .
                        (lambda ()
                          (interactive)
                          (exwm-workspace-switch-create ,i))))
                    (number-sequence 0 9))
          ([?\s-&] . (lambda (command)
                       (interactive (list (read-shell-command "$ ")))
                       (start-process-shell-command command nil command)))
          (,(kbd "C-;") . other-window)
          (,(kbd "C-'") . other-frame)
          (,(kbd "s-k") . exwm-workspace-delete)
          ))
    (setq exwm-input-simulation-keys
  	'(
  	  ([?\M-w] . [?\C-c])
  	  ([?\C-y] . [?\C-v])
  	  ))
    (setq exwm-workspace-show-all-buffers t)
    (setq exwm-layout-show-all-buffers t)
    (add-hook 'exwm-update-class-hook
  	    (lambda ()
  	      (exwm-workspace-rename-buffer exwm-class-name)))
    (setq exwm-input-prefix-keys (delete ?\C-h exwm-input-prefix-keys))
    (setq exwm-input-prefix-keys (add-to-list 'exwm-input-prefix-keys ?\C-g))
    (exwm-enable)
  (call-process-shell-command "ibus-daemon -drxR")
    (use-package desktop-environment
      :ensure nil
  
      :config
      ;; For some reason, this has to be after exwm setup
      (setq desktop-environment-update-exwm-global-keys :global)
      (desktop-environment-mode))
    (defun desktop-environment-screenshot ()
      (interactive)
      (shell-command "sleep 0.2; scrot -s '/tmp/%F_%T_$wx$h.png' -e 'xclip -selection clipboard -target image/png -i $f &>/dev/null'"))
      (setq display-time-day-and-date t)
      (setq display-time-24hr-format t)
      (setq display-time-default-load-average nil)
      (display-time-mode 1)
      (display-battery-mode 1))

  (setq custom-safe-themes t)

(use-package smart-mode-line
  :config
  (setq sml/theme 'dark)
  (setq sml/mode-width 0)
  (sml/setup)
  )

(use-package mini-modeline
  :after smart-mode-line

  :config
