emacs/.emacs.d/config.org
*** cfg
:PROPERTIES:
:created:  2020-06-02 20:55:37 EDT
:header-args: :tangle no :noweb-ref mini-modeline-config :results silent
:END:
Make space for systemtray. 
#+BEGIN_SRC emacs-lisp
(setq mini-modeline-right-padding 20)
#+END_SRC

For some reason, [2020-06-02 Tue] mini-modeline does not agree with
line-number-mode. See [[https://github.com/kiennq/emacs-mini-modeline/issues/34][github issue]]. I'm turning it off and inserting
manually.
#+BEGIN_SRC emacs-lisp
(line-number-mode 0)
(defun jmw/mode-line-buffer-pos ()
  (concat 
   (number-to-string (line-number-at-pos))
   ":"
   (number-to-string (current-column))
   ))
#+END_SRC

Main format.
#+BEGIN_SRC emacs-lisp
(setq mini-modeline-r-format
      '("" ;; mode line construct needs to start with a string
        "%e"
        mode-line-front-space
				(:eval (jmw/mode-line-buffer-pos))
				mode-line-position
        ;; (:eval (string-trim (format-mode-line mode-line-position)))
        mode-line-mule-info
        mode-line-client
        mode-line-modified
        mode-line-remote
				;; empty if running in window system
        mode-line-frame-identification
        mode-line-buffer-identification
				"   "
				;; I guess this is for evil mode
        ;; evil-mode-line-tag
        (:eval (string-trim (format-mode-line mode-line-modes)))
				"   "
        mode-line-misc-info
        ))
#+END_SRC

Invoke. 
#+BEGIN_SRC emacs-lisp
(mini-modeline-mode t)
#+END_SRC
** js2-mode
   :PROPERTIES:
   :created:  2020-03-23 13:53:15 EDT
   :END:
An improved javascript major mode. 
#+BEGIN_SRC emacs-lisp
  (use-package js2-mode
    :config
    (add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))
    (setq js-indent-level 2))
#+END_SRC
** smart-tabs-mode
:PROPERTIES:
:created:  2020-10-05 23:59:15 EDT
:END:
Tabs for indentation, spaces for alignment. 

The [[https://docs.microsoft.com/en-us/archive/blogs/cyrusn/tabs-vs-spaces?utm_source=thenewstack&utm_medium=website&utm_campaign=platform][least wrong]] of the three opinions on tabs vs spaces. 

#+begin_src emacs-lisp
(use-package smart-tabs-mode
  :config
  (smart-tabs-insinuate 'c++ 'c))
#+end_src
** c++-mode
:PROPERTIES:
:created:  2020-10-06 11:41:15 EDT
:END:
#+BEGIN_SRC emacs-lisp
(defun inside-class-enum-p (pos)
  "Checks if POS is within the braces of a C++ \"enum class\"."
  (ignore-errors
    (save-excursion
      (goto-char pos)
      (up-list -1)
      (backward-sexp 1)
      (looking-back "enum[ \t]+class[ \t]+[^}]+"))))

(defun align-enum-class (langelem)
  (if (inside-class-enum-p (c-langelem-pos langelem))
      0
    (c-lineup-topmost-intro-cont langelem)))

(defun align-enum-class-closing-brace (langelem)
  (if (inside-class-enum-p (c-langelem-pos langelem))
      '-
    '+))

(defun fix-enum-class ()
  "Setup `c++-mode' to better handle \"class enum\"."
  (add-to-list 'c-offsets-alist '(topmost-intro-cont . align-enum-class))
  (add-to-list 'c-offsets-alist
               '(statement-cont . align-enum-class-closing-brace)))

(add-hook 'c++-mode-hook 'fix-enum-class)

#+END_SRC
** typescript-mode
:PROPERTIES:
:created:  2021-05-13 12:53:45 EDT
:END:
Indent with two spaces. Changing =tab-stop-list= doesn't work, not sure
why.
#+begin_src emacs-lisp
(setq typescript-indent-level 2)
#+end_src

Raise and lower volume.
#+begin_src emacs-lisp
(define-key 'jmw/emms-prefix (kbd "+") 'emms-volume-raise)
(define-key 'jmw/emms-prefix (kbd "-") 'emms-volume-lower)
#+end_src
* mode
Related to a mode, minor or major. 
** custom
   :PROPERTIES:
   :created:  2020-01-29 18:33:43 CST
   :END:
Custom is Emacs's user-friendly customization interface. I don't like
it, I prefer simple =setq='s. 

I don't like having Custom litter my =init.el= with stuff. This sets it
to save in a different file, which I don't load. Normally, Custom will
do nothing anyway, but occasionally I'll do something that causes it to
randomly pop back into my =init.el=. 
#+BEGIN_SRC emacs-lisp 
  (setq custom-file (concat user-emacs-directory "/custom.el"))
#+END_SRC
** size-indication-mode
   :PROPERTIES:
   :created:  2020-03-21 14:21:26 EDT
   :END:
Display size of buffer on the mode line. 
#+BEGIN_SRC emacs-lisp
  (size-indication-mode 1)
#+END_SRC
** emacs-lisp-mode
:PROPERTIES:
:created:  2020-05-22 17:23:47 EDT
:END:
Don't use tabs for lisp indentation. 
#+BEGIN_SRC emacs-lisp
(add-hook 'emacs-lisp-mode-hook
          (lambda () (setq indent-tabs-mode nil)))
#+END_SRC
** electric-indent-mode
:PROPERTIES:
:created:  2020-05-22 17:32:30 EDT
:END:
By default, electric-indent-mode indents the previous /and/ the next
line. I almost never want the former. Using solution from [[https://emacs.stackexchange.com/a/20899/21253][SE]]. 
#+BEGIN_SRC emacs-lisp
(setq-default electric-indent-inhibit t)
#+END_SRC
** indent-tabs-mode
:PROPERTIES:
:created:  2021-04-29 17:55:45 EDT
:END:
By default, don't indent using tabs. 
#+begin_src emacs-lisp
(setq-default indent-tabs-mode nil)
#+end_src
** other
#+BEGIN_SRC emacs-lisp
(ignore-errors
  (menu-bar-mode 0) 
  (tool-bar-mode 0) 
  (scroll-bar-mode 0)
  (winner-mode 1)
  (fringe-mode 1))
#+END_SRC
* startup
Look and feel of emacs upon after startup. 

[2020-10-07 Wed 22:16] Changed from =set-default-font= to
=set-frame-font=, see [[https://blog.leiwang.info/posts/emacs-set-default-font/][here]]. 
#+BEGIN_SRC emacs-lisp
  (add-to-list 'default-frame-alist '(fullscreen . fullboth))
  (set-frame-font "Ubuntu Mono-12" t t)
  (setq inhibit-startup-screen t)
#+END_SRC

Setup standard applications in EXWM. [2020-03-17 Tue] I guess I'll call
manually. For some reason, putting it in =window-setup-hook= doesn't
work.
#+BEGIN_SRC emacs-lisp
	(defun jmw/exwm-standard-apps ()
		(interactive)

		(exwm-workspace-switch-create 1)
		(let ((browser (getenv "BROWSER")))
			(start-process-shell-command browser nil browser))

		(sleep-for 1)

		(exwm-workspace-switch-create 2)
		(let ((pdf-viewer (getenv "PDF_VIEWER")))
			(start-process-shell-command pdf-viewer nil pdf-viewer))

		(sleep-for 1)

		(exwm-workspace-switch-create 3)
		(start-process-shell-command "anki" nil "anki")

		(sleep-for 1)
		)
#+END_SRC

Applications to run at login. 
#+BEGIN_SRC emacs-lisp
	(defun jmw/exwm-startup-apps ()
		;; if megasync doesn't detect a system tray, it'll pop up a window.
		;; sleep so it will detect a system tray
		(start-process-shell-command "megasync" nil "sleep 5; megasync")
		)
#+END_SRC

These are the initial files I want open. 
#+BEGIN_SRC emacs-lisp
(setq jmw/init-file-list (list
	                        (getenv "JMW_EMACS_CONFIG")
                          (getenv "JMW_LATEX_CONFIG")
                          (getenv "JMW_SH_CONFIG")
                          "/home/michael/core/mind/ob/hum/ex/misc.org"
	                        ))
#+END_SRC

The main thing. 
#+BEGIN_SRC emacs-lisp
(add-hook 'window-setup-hook
			    (lambda ()
				    (split-window-right) 
				    (split-window-right)
				    (balance-windows)
				    (dolist (fname jmw/init-file-list)
		          (find-file fname))
				    (find-file (concat (getenv "PROC_DIR")
				                       "/main.org"))
            (setq jmw/main-window (get-buffer-window "main.org"))
            (setq jmw/main-frame (selected-frame))
				    (set-window-dedicated-p jmw/main-window
							                      t) 
				    (windmove-right)
				    (vterm)
				    (windmove-right)
				    (vterm)
				    (when (member 'exwm features)
					    ;; We're using exwm
					    (jmw/exwm-startup-apps))
				    (select-window jmw/main-window))
          )
#+END_SRC
** theme
   :PROPERTIES:
   :created:  2020-01-28 22:45:41 CST
   :END:
[2020-01-28 Tue] I haven't given this much thought. =manoj-dark= is
fine. 

[2020-03-17 Tue] trying other stuff. Decided to stick with this. 
#+BEGIN_SRC emacs-lisp 
  (load-theme 'manoj-dark)
#+END_SRC

The default face for the current clocking task isn't very readable. 
#+BEGIN_SRC emacs-lisp
(set-face-attribute 'org-mode-line-clock
		    nil
		    :foreground "cyan3")
#+END_SRC
