emacs/.emacs.d/config.el
  (setq mini-modeline-right-padding 20)
  (line-number-mode 0)
  (defun jmw/mode-line-buffer-pos ()
    (concat 
     (number-to-string (line-number-at-pos))
     ":"
     (number-to-string (current-column))
     ))
  (setq mini-modeline-r-format
        '("" ;; mode line construct needs to start with a string
          "%e"
          mode-line-front-space
  				(:eval (jmw/mode-line-buffer-pos))
  				mode-line-position
          ;; (:eval (string-trim (format-mode-line mode-line-position)))
          mode-line-mule-info
          mode-line-client
          mode-line-modified
          mode-line-remote
  				;; empty if running in window system
          mode-line-frame-identification
          mode-line-buffer-identification
  				"   "
  				;; I guess this is for evil mode
          ;; evil-mode-line-tag
          (:eval (string-trim (format-mode-line mode-line-modes)))
  				"   "
          mode-line-misc-info
          ))
  (mini-modeline-mode t)
  )

  (use-package js2-mode
    :config
    (add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))
    (setq js-indent-level 2))

(use-package smart-tabs-mode
  :config
  (smart-tabs-insinuate 'c++ 'c))

(defun inside-class-enum-p (pos)
  "Checks if POS is within the braces of a C++ \"enum class\"."
  (ignore-errors
    (save-excursion
      (goto-char pos)
      (up-list -1)
      (backward-sexp 1)
      (looking-back "enum[ \t]+class[ \t]+[^}]+"))))

(defun align-enum-class (langelem)
  (if (inside-class-enum-p (c-langelem-pos langelem))
      0
    (c-lineup-topmost-intro-cont langelem)))

(defun align-enum-class-closing-brace (langelem)
  (if (inside-class-enum-p (c-langelem-pos langelem))
      '-
    '+))

(defun fix-enum-class ()
  "Setup `c++-mode' to better handle \"class enum\"."
  (add-to-list 'c-offsets-alist '(topmost-intro-cont . align-enum-class))
  (add-to-list 'c-offsets-alist
               '(statement-cont . align-enum-class-closing-brace)))

(add-hook 'c++-mode-hook 'fix-enum-class)

(setq typescript-indent-level 2)

  (setq custom-file (concat user-emacs-directory "/custom.el"))

  (size-indication-mode 1)

(add-hook 'emacs-lisp-mode-hook
          (lambda () (setq indent-tabs-mode nil)))

(setq-default electric-indent-inhibit t)

(setq-default indent-tabs-mode nil)

(ignore-errors
  (menu-bar-mode 0) 
  (tool-bar-mode 0) 
  (scroll-bar-mode 0)
  (winner-mode 1)
  (fringe-mode 1))

  (add-to-list 'default-frame-alist '(fullscreen . fullboth))
  (set-frame-font "Ubuntu Mono-12" t t)
  (setq inhibit-startup-screen t)

	(defun jmw/exwm-standard-apps ()
		(interactive)

		(exwm-workspace-switch-create 1)
		(let ((browser (getenv "BROWSER")))
			(start-process-shell-command browser nil browser))

		(sleep-for 1)

		(exwm-workspace-switch-create 2)
		(let ((pdf-viewer (getenv "PDF_VIEWER")))
			(start-process-shell-command pdf-viewer nil pdf-viewer))

		(sleep-for 1)

		(exwm-workspace-switch-create 3)
		(start-process-shell-command "anki" nil "anki")

		(sleep-for 1)
		)

	(defun jmw/exwm-startup-apps ()
		;; if megasync doesn't detect a system tray, it'll pop up a window.
		;; sleep so it will detect a system tray
		(start-process-shell-command "megasync" nil "sleep 5; megasync")
		)

(setq jmw/init-file-list (list
	                        (getenv "JMW_EMACS_CONFIG")
                          (getenv "JMW_LATEX_CONFIG")
                          (getenv "JMW_SH_CONFIG")
	                        ))

(add-hook 'window-setup-hook
			    (lambda ()
				    (split-window-right) 
				    (split-window-right)
				    (balance-windows)
				    (dolist (fname jmw/init-file-list)
		          (find-file fname))
				    (find-file (concat (getenv "PROC_DIR")
				                       "/main.org"))
            (setq jmw/main-window (get-buffer-window "main.org"))
            (setq jmw/main-frame (selected-frame))
				    (set-window-dedicated-p jmw/main-window
							                      t) 
				    (windmove-right)
				    (vterm)
				    (windmove-right)
				    (vterm)
				    (when (member 'exwm features)
					    ;; We're using exwm
					    (jmw/exwm-startup-apps))
				    (select-window jmw/main-window))
          )

  (load-theme 'manoj-dark)

(set-face-attribute 'org-mode-line-clock
		    nil
		    :foreground "cyan3")
