emacs/.emacs.d/config.org
* other
  :LOGBOOK:
  CLOCK: [2020-01-09 Thu 16:30]--[2020-01-09 Thu 16:31] =>  0:01
  :END:
Default case. As of [2019-12-24 Tue], not too organized. 

Define =jmw/prefix=. This is the prefix key for my personal stuff. 
#+BEGIN_SRC emacs-lisp
  (fset 'jmw/prefix (make-sparse-keymap))
  (global-set-key (kbd "C-c j") 'jmw/prefix)
#+END_SRC

By default, Emacs will create backups of files, which look like
#+BEGIN_EXAMPLE
[michael@contessa test-backup]$ ls
test.org  test.org~
#+END_EXAMPLE
which I don't like. If I need backups, I'll use version control. 
#+BEGIN_SRC emacs-lisp
  (setq make-backup-files nil)
#+END_SRC

Leave point at the same screen position when paging down. Don't know why
the default is to move point to the top of the window.
#+BEGIN_SRC emacs-lisp
  (setq scroll-preserve-screen-position t)
#+END_SRC

Start the emacs server. This allows the command =emacsclient(1)= to open
a file in a buffer owned by an existing emacs process, which is used in
=git-commit(1)=.
#+BEGIN_SRC emacs-lisp
  (server-start)
#+END_SRC

Break at 72 chars. 
#+BEGIN_SRC emacs-lisp
  (setq-default fill-column 72)
#+END_SRC

Window width for textual buffers. Resize to it. 
#+BEGIN_SRC emacs-lisp
(setq jmw/text-window-width (+ fill-column 3))
(defun jmw/resize-text-window ()
	(interactive)
	(window-resize (selected-window)
								 (- jmw/text-window-width (window-width))
								 t))
	
#+END_SRC

Useful for opening a LaTeX editing window next to Okular. 
#+BEGIN_SRC emacs-lisp
(defun jmw/split-text-window-right ()
  (interactive)
  (split-window-right)
	(sit-for 0.001)
  (windmove-right)
  (jmw/resize-text-window)
  ;; (switch-to-buffer (get-buffer-create "*scratch*"))
  )
(define-key 'jmw/prefix "3" 'jmw/split-text-window-right)
#+END_SRC

Set the display tab stop. Tabs are displayed as a space that extends to
the next tab stop column.

This is unrelated to how ~<TAB>~ works as a command.
#+BEGIN_SRC emacs-lisp
(setq-default tab-width 2)
#+END_SRC

These aren't bound to anything by default. Put them to good use. 
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-;") 'other-window)
  (define-key org-mode-map (kbd "C-'") nil)
  (global-set-key (kbd "C-'") 'other-frame)
#+END_SRC

Type ~y~ or ~n~ instead of yes/no. One would think there was a better
way. 
#+BEGIN_SRC emacs-lisp
  (fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC

If exists a window containing buffer, switch to it. Otherwise, switch to
buffer.
#+BEGIN_SRC emacs-lisp
  (defun switch-to-window-or-buffer (buffer)
    (let ((containing-window (get-buffer-window buffer t)))
      (if containing-window
	  (select-window containing-window)
	(switch-to-buffer buffer))))
#+END_SRC

Insert the current time. 
#+BEGIN_SRC emacs-lisp
(defun jmw/insert-instant ()
  (interactive)
  (org-time-stamp-inactive '(16)))
(define-key 'jmw/prefix "t" 'jmw/insert-instant)
#+END_SRC

Do not have ctl-z suspend.
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-z"))
#+END_SRC

Yank current buffer.
#+begin_src emacs-lisp
(defun jmw/kill-buffer-filename ()
  (interactive)
  (kill-new (buffer-file-name)))
(define-key 'jmw/prefix "b" 'jmw/kill-buffer-filename)
#+end_src

Lock the screen. =slock= seems to be the simplest solution. 
#+begin_src emacs-lisp
(defun jmw/lock-screen ()
    (call-process-shell-command "slock"))
#+end_src

Swap caps lock and left control.
#+begin_src emacs-lisp
(defun jmw/swap-caps ()
  (interactive)
  (call-process-shell-command "/usr/bin/setxkbmap -option 'ctrl:swapcaps'"))
(define-key 'jmw/prefix "k" 'jmw/swap-caps)
#+end_src

#+begin_src emacs-lisp
(define-key 'jmw/prefix "r" 'rename-buffer)
#+end_src
** 7z
I use 7z as my default encryption format. This opens 7z files in the
style I want: the file will be extracted to my temporary directory when
first called, and rearchived when called again.
#+BEGIN_SRC emacs-lisp
  (defun jmw/7z (zfile file outfile)
    (if (file-exists-p outfile)
	;; If outfile exists, put it back into the zfile (the 7z archive)
	(progn
	  (message "Preparing to compress")
	  (sit-for 0.25)
	  (call-process-shell-command
	   (concat "7z a -p"
		   (read-passwd "Password? " t)
		   " "
		   zfile
		   " "
		   outfile))
	  (call-process-shell-command
	   (concat 
	    "shred -u "
	    outfile)))
      ;; Otherwise, extract it
      (progn
	(message "Preparing to extract")
	(sit-for 0.25)
	(unless (file-exists-p zfile)
	  (error (concat
		  "Archive file "
		  zfile
		  " does not exist.")))
	(while (not (eq
		     (call-process-shell-command
		      (concat "7z e -p"
			      (read-passwd "Password? ")
			      " -o"
			      (getenv "JMW_TEMP") 
			      " "
			      zfile
			      " "
			      file))
		     0))
	  (message "Incorrect Password. Try again.")
	  (sit-for 0.5))
	(find-file outfile))))

#+END_SRC

The wander archive is a kind of diary. I write in it about once a
month. 
#+BEGIN_SRC emacs-lisp
  (defun jmw/wander ()
    (interactive)
    (jmw/7z (getenv "WANDER_ARCHIVE")
	    "wander.txt"
	    (concat (getenv "JMW_TEMP")
		    "/wander.txt")))
  (define-key 'jmw/prefix "w" 'jmw/wander)
#+END_SRC

The safe archive contains passwords. 
#+BEGIN_SRC emacs-lisp
  (defun jmw/safe ()
    (interactive)
    (jmw/7z (getenv "SAFE_ARCHIVE")
	    "safe.org"
	    (concat (getenv "JMW_TEMP")
		    "/safe.org")))
  (define-key 'jmw/prefix "s" 'jmw/safe)
#+END_SRC
** timer
   :PROPERTIES:
   :created:  2020-02-01 20:12:03 CST
   :END:
I use timers in my workflow. They're usually end conditions of runs.

Define the timer prefix, and bind it. 
#+BEGIN_SRC emacs-lisp
  (fset 'jmw/timer-prefix (make-sparse-keymap))
  (global-set-key (kbd "C-c t") 'jmw/timer-prefix)
#+END_SRC

This is how you create a timer. In the future, this should be extended
to take in info about the current run. 
#+BEGIN_SRC emacs-lisp
  (defun jmw/run-with-timer (durationspec)
    (interactive "sDuration: ")
    (setq jmw/timer
	  (run-with-timer (timer-duration durationspec)
			  0.5
			  'jmw/times-up)))
  (define-key 'jmw/timer-prefix "s" 'jmw/run-with-timer)
#+END_SRC

This is what happens when time is up. 
#+BEGIN_SRC emacs-lisp
  (defun jmw/times-up ()
    "Single function run when timer expires"
    (play-sound-file "~/core/prod/bin/other/alarm.wav"))
#+END_SRC

The rest of these functions need serious work.
#+BEGIN_SRC emacs-lisp
  (defun jmw/find-timer (timerlist)
    (if timerlist
	(if (equal (timer--function (car timerlist))
		   'jmw/times-up)
	    (car timerlist)
	  (jmw/find-timer (cdr timerlist)))
      nil))
  (defun jmw/cancel-timer ()
    (interactive)
    (cancel-timer jmw/timer)
    (let ((timer (jmw/find-timer timer-list)))
      (if timer
	  (setq jmw/timer timer))))
  (defun jmw/time-left ()
    "Timer info. May be expanded to more than just time remaining."
    (interactive)
    (let* ((time-diff (time-subtract (timer--time jmw/timer)
				     (current-time)))
	   (floats (float-time time-diff))
	   (seconds (floor floats)))
      (message "%ss" seconds)))
  (define-key 'jmw/timer-prefix "c" 'jmw/cancel-timer)
  (define-key 'jmw/timer-prefix "d" 'jmw/time-left) ;; "display"
#+END_SRC
** tests
:PROPERTIES:
:created:  2020-10-08 12:36:53 EDT
:END:
#+begin_src emacs-lisp
(setq fst-test-001 567)
#+end_src

#+begin_src emacs-lisp :tangle no
(setq fst-test-002 567)
#+end_src
