emacs/.emacs.d/config.el

  (fset 'jmw/prefix (make-sparse-keymap))
  (global-set-key (kbd "C-c j") 'jmw/prefix)

  (setq make-backup-files nil)

  (setq scroll-preserve-screen-position t)

  (server-start)

  (setq-default fill-column 72)

(setq jmw/text-window-width (+ fill-column 3))
(defun jmw/resize-text-window ()
	(interactive)
	(window-resize (selected-window)
								 (- jmw/text-window-width (window-width))
								 t))

(defun jmw/split-text-window-right ()
  (interactive)
  (split-window-right)
	(sit-for 0.001)
  (windmove-right)
  (jmw/resize-text-window)
  ;; (switch-to-buffer (get-buffer-create "*scratch*"))
  )
(define-key 'jmw/prefix "3" 'jmw/split-text-window-right)

(setq-default tab-width 2)

  (global-set-key (kbd "C-;") 'other-window)
  (define-key org-mode-map (kbd "C-'") nil)
  (global-set-key (kbd "C-'") 'other-frame)

  (fset 'yes-or-no-p 'y-or-n-p)

  (defun switch-to-window-or-buffer (buffer)
    (let ((containing-window (get-buffer-window buffer t)))
      (if containing-window
	  (select-window containing-window)
	(switch-to-buffer buffer))))

(defun jmw/insert-instant ()
  (interactive)
  (org-time-stamp-inactive '(16)))
(define-key 'jmw/prefix "t" 'jmw/insert-instant)

(global-unset-key (kbd "C-z"))

  (defun jmw/7z (zfile file outfile)
    (if (file-exists-p outfile)
	;; If outfile exists, put it back into the zfile (the 7z archive)
	(progn
	  (message "Preparing to compress")
	  (sit-for 0.25)
	  (call-process-shell-command
	   (concat "7z a -p"
		   (read-passwd "Password? " t)
		   " "
		   zfile
		   " "
		   outfile))
	  (call-process-shell-command
	   (concat 
	    "shred -u "
	    outfile)))
      ;; Otherwise, extract it
      (progn
	(message "Preparing to extract")
	(sit-for 0.25)
	(unless (file-exists-p zfile)
	  (error (concat
		  "Archive file "
		  zfile
		  " does not exist.")))
	(while (not (eq
		     (call-process-shell-command
		      (concat "7z e -p"
			      (read-passwd "Password? ")
			      " -o"
			      (getenv "JMW_TEMP") 
			      " "
			      zfile
			      " "
			      file))
		     0))
	  (message "Incorrect Password. Try again.")
	  (sit-for 0.5))
	(find-file outfile))))

  (defun jmw/wander ()
    (interactive)
    (jmw/7z (getenv "WANDER_ARCHIVE")
	    "wander.txt"
	    (concat (getenv "JMW_TEMP")
		    "/wander.txt")))
  (define-key 'jmw/prefix "w" 'jmw/wander)

  (defun jmw/safe ()
    (interactive)
    (jmw/7z (getenv "SAFE_ARCHIVE")
	    "safe.org"
	    (concat (getenv "JMW_TEMP")
		    "/safe.org")))
  (define-key 'jmw/prefix "s" 'jmw/safe)

  (fset 'jmw/timer-prefix (make-sparse-keymap))
  (global-set-key (kbd "C-c t") 'jmw/timer-prefix)

  (defun jmw/run-with-timer (durationspec)
    (interactive "sDuration: ")
    (setq jmw/timer
	  (run-with-timer (timer-duration durationspec)
			  0.5
			  'jmw/times-up)))
  (define-key 'jmw/timer-prefix "s" 'jmw/run-with-timer)

  (defun jmw/times-up ()
    "Single function run when timer expires"
    (play-sound-file "~/core/prod/bin/other/alarm.wav"))

  (defun jmw/find-timer (timerlist)
    (if timerlist
	(if (equal (timer--function (car timerlist))
		   'jmw/times-up)
	    (car timerlist)
	  (jmw/find-timer (cdr timerlist)))
      nil))
  (defun jmw/cancel-timer ()
    (interactive)
    (cancel-timer jmw/timer)
    (let ((timer (jmw/find-timer timer-list)))
      (if timer
	  (setq jmw/timer timer))))
  (defun jmw/time-left ()
    "Timer info. May be expanded to more than just time remaining."
    (interactive)
    (let* ((time-diff (time-subtract (timer--time jmw/timer)
				     (current-time)))
	   (floats (float-time time-diff))
	   (seconds (floor floats)))
      (message "%ss" seconds)))
  (define-key 'jmw/timer-prefix "c" 'jmw/cancel-timer)
  (define-key 'jmw/timer-prefix "d" 'jmw/time-left) ;; "display"

(setq fst-test-001 567)
